{
    "uporabniki": {
        "person_1": {
            "username": "David",
            "password": "tego",
            "liked_recipe": [
                "Tortilije",
                "Skutina torta"
            ],
            "disliked_recipe": []
        },
        "person_2": {
            "username": "darkofekonja",
            "password": "bonsaisozakon",
            "liked_recipe": [
                "Tortilije",
                "Skutina torta"
            ],
            "disliked_recipe": [
                "Gobova juha"
            ]
        }
    },
    "recepti": {
        "recept_1": {
            "owner": "David",
            "title": "Tortilije",
            "ingredients": "- 500g piščančjih prsi\r\n- 1 čebula \r\n- 1 paprika   \r\n- 700g sira\r\n- 10 tortilij\r\n- salsa       \r\n- 1 paradižnikova mezga      \r\n- sol in poper",
            "procedure": "Piščanca skuhajte in ga potem natrgajte na manjše trakce. Čebulo in papriko narežite čim manjše in jih skupaj s salso in poljubnimi začimbami zmešajte v ločeni posodi. Ko ste piščanca natrgali na manjše koščke jih dodajte v to posodo in vse skupaj zalijte s paradižnikovo mezgo. Dobro zmešajte. Tortilje prerežite po polovici in naribajte sir. Tako manjše tortilje pa potem začnite polniti z mešanico, ki ste jo namešali v posodi. Čez to lahko v tortiljo dodate tudi že prej narezan sir. Tortilije polagajte v pladenj in čez njih, preden jih daste v pečico, stresite še dodaten sir. Ko ste pladenj napolnili s polnimi, s sirom prekritimi tortiljami jih lahko še namažete s kakšnim prelivom, potem pajih  dajte v že prej segreto pečico. Pečite jih na 200C približno 20min oziroma do zlato rjave barve testa.",
            "image": "Database/tortilje.jpg",
            "likes": 5,
            "dislikes": 2,
            "comments": [
                "Waaaw zelo dobre tortilije s preprostim receptom. "
            ]
        },
        "recept_2": {
            "owner": "darkofekonja",
            "title": "Gobova juha",
            "ingredients": "- 1 čebula\r\n- 2 stroka česna\r\n- paradižnikova mezga\r\n- lovorjev list\r\n- majaron\r\n- timijan\r\n- peteršilj\r\n- poper\r\n- sol\r\n- vegeta\r\n- gobe (lisičke, jurčki)\r\n- 2 večja krompirja ",
            "procedure": "Prepražiš čebulo. Dodaš česen, paradižnikovo mezgo, lovorjev list, majaron, timijan, peteršilj, vegeto in poper. V drugi posodi zavreš vodo in vanjo streseš narezane gobe ( ne pretanko narazane) in jih popražiš. Dodaš jih v lonec. V lonec dodaš tudi na majhne kocke narezan krompir. Pomembno je, da sestavine veliko mešaš! Da ni juha preveč redka dodaš eno žlico moke in zaliješ z vodo. V ekonomu jo kuhaš približno sedem minut. Juho soliš po okusu.  ",
            "image": "Database/gobova-juha.jpg",
            "likes": 3,
            "dislikes": 1,
            "comments": [
                "to je komentar",
                "komentar?"
            ]
        },
        "recept_3": {
            "owner": "darkofekonja",
            "title": "Skutina torta",
            "ingredients": " - 200g mleti piškoti (plazma, leibniz)\r\n- 100g masla\r\n-750g pasirane skute\r\n-10 žlic sladkorja\r\n- 2 vreči vanilij sladkorja\r\n- 0.5l sladke smetane\r\n- 30g želatine\r\n- 8 žlic vode\r\n- 600g malin in borovnic\r\n",
            "procedure": "Mlete piškote zmešamo z maslom. V loženo posodo dodamo želatino in 8 žlic vode stresemo skupaj in dodamo 0.5l sladke smetane. To dobro zmešamo in dodamo v posodo, kjer smo prej žmešali pasirano skuto, 10 žlic sladkorja in 2 vrečki vanilij sladkorja. Vse to pa še enkrat dobro premešamo. V maso dodamo še maline in borovnice.\r\nV tortni model pripraviš peki papir in maso (piškot in maslo) in poteptaš po dnu. Torto v pekaču daš v hladilnik čez noč.",
            "image": "Database/skutina-torta.jpg",
            "likes": 6,
            "dislikes": 1,
            "comments": [
                "jeeej torta",
                "ajmoooooo",
                "to je to\r\n"
            ]
        }
    }
}